<<<<<<< Updated upstream
''' 2.26. На празднике нужно рассадить n гостей за столы. Каждый стол
рассчитан на k человек. Сколько нужно столов, чтобы поместились все
гости? '''

import math

n = int(input('Введите количество гостей: '))
k = int(input('Введите допустимое количество людей за столом: '))
x = math.ceil(n / k)
print('Нужное количество столов = ', x)
=======
''' 2.26. На празднике нужно рассадить n гостей за столы. Каждый стол
рассчитан на k человек. Сколько нужно столов, чтобы поместились все
гости? '''

import math

n = int(input('Введите количество гостей: '))
k = int(input('Введите допустимое количество людей за столом: '))
x = math.ceil(n / k)
print('Нужное количество столов = ', x)
>>>>>>> Stashed changes
