# ЕГЭ-13

- **Типовая задача**
    
    ```python
    from ipaddress import *
    
    net = ip_network('192.168.32.160/255.255.255.240')
    k = 0
    for ip in net:
        ips = f'{ip:b}'
        #print(ips)
        if ips.count('1') % 2 == 0:
            k += 1
    print(k)
    '''
    Алгоритм - 
    1)ip_network(айпи адресс/маска)
    2)Затем создаем двоичную запись каждого айпишника
    3)и выполняем условия
    '''
    ```
    
- **Неплохая задачка(Поразрядная конъюкция)**
    
    ```python
    ''' 167)  (А. Минак) В терминологии сетей TCP/IP маской сети называют
    двоичное число, которое показывает, какая часть IP-адреса узла сети
    относится к адресу сети, а какая - к адресу узла в этой сети. Адрес сети
    получается в результате применения поразрядной конъюнкции к заданному
    адресу узла и маске сети.
    
    Сеть задана IP-адресом 140.19.96.0 и маской
    сети 255.255.248.0. Сколько в этой сети IP-адресов, для которых
    количество единиц в каждом байте IP-адреса одинаково? '''
    from ipaddress import *
    
    net = ip_network('140.19.96.0/255.255.248.0')
    k = 0
    
    for ip in net:
        ips = f'{ip}'
        a = [int(x) for x in ips.split('.')]
        a = [f'{x:b}'.count('1') for x in a]
        if a[0] == a[1] and a[1] == a[2] and a[2] == a[3]:
             k += 1
    print(k)#168
    ```
    
- **Айпишник,маски,узлы**
    
    ```python
    '''
    153)	Для узла c IP-адресом 115.53.128.88 адрес подсети равен
    115.53.128.0. Сколько существует различных возможных значений
    третьего слева байта маски, если известно, что в этой сети не
    менее 1000 узлов?
    Ответ запишите в виде десятичного числа.
    '''
    '''
    1000 => не менее 10 нулей => (не менее 2 + 8)#2 - в конце ,а 8 - остальные 
    (т.к 2**10 > 1000,для 2000 => 2**11 > 200)
    
    ip :    115.53.128.88
    maska:  255.255.x.0
    ---------------------
    adress: 115.53.128.0
    
    ----------------
    ip 128: 10000000
    maska : 1-------
    adress: 10000000
    
    10000000
    11000000
    11100000
    11110000
    11111000
    11111100
    otvet = 6
    '''
    ```
    
- **Количество 0 посчитать**
    
    ```python
    ''' 39)  В терминологии сетей TCP/IP маской подсети называется
    32-разрядное двоичное число, определяющее, какие именно разряды
    IP-адреса компьютера являются общими для всей подсети – в этих разрядах
    маски стоит 1. Обычно маски записываются в виде четверки десятичных
    чисел - по тем же правилам, что и IP-адреса.
    
    Для некоторой подсети
    используется маска 255.255.254.0. Сколько различных адресов компьютеров
    теоретически допускает эта маска, если два адреса (адрес сети и
    широковещательный) не используют?
    
    Считаем кол-во 0
    254 = 11111110_2 => 1
    0 => 0000000000_2 >= 8
    9 => 2**9 = 512
    
    Сколько различных адресов компьютеров
    теоретически допускает эта маска, если два адреса (адрес сети и
    широковещательный) не используют?
    то 512 - 2 = 510
    '''
    ------------------------------------
    ''' 40)  В терминологии сетей TCP/IP маской подсети называется
    32-разрядное двоичное число, определяющее, какие именно разряды
    IP-адреса компьютера являются общими для всей подсети - в этих разрядах
    маски стоит 1. Обычно маски записываются в виде четверки десятичных
    чисел - по тем же правилам, что и IP-адреса.
    
    Для некоторой подсети
    используется маска 255.255.255.128. Сколько различных адресов
    компьютеров теоретически допускает эта маска, если два адреса (адрес
    сети и широковещательный) не используют?
    
    128 = 10000000_2 = 7
    2**7 - 2 = 128 - 2 = 126
    
    Алгоритм -
    1)Переводим во вторичную систему счисления все числа ,кроме 255
    и считаем в них кол-во 0(n)
    2)возводим 2 ** n - Ответ
    если есть - 
    если два адреса (адрес
    сети и широковещательный) не используют?
    2 ** n - 2
    '''
    ```
    
- **Два Узла**
    
    ```python
    '''
    98) (Д.В. Богданов) Два узла, находящиеся в одной сети, имеют
    IP-адреса 154.28.80.25 и 154.28.90.25. Укажите наименьшее возможное количество нулей
    в маске сети.
    
    ip1: 154.28.80.25
    ip2: 154.28.90.25
    mask: 255.255.x.0
    11111111 11111111 11110000 00000000
    
    ip1: 01010000
    ip2: 01011010
    mask:   !
         11110000
    
    ip1:  01010000
    mask: 11110000
          01010000
    
    otvet = 12
    '''
    ```
    
- **Айпишник и узел**
    
    ```python
    '''
    153)	Для узла c IP-адресом 115.53.128.88 адрес подсети равен
    115.53.128.0. Сколько существует различных возможных значений
    третьего слева байта маски, если известно, что в этой сети не
    менее 1000 узлов?
    Ответ запишите в виде десятичного числа.
    '''
    '''
    1000 => не менее 10 нулей => (не менее 2 + 8)#2 - в конце ,а 8 - остальные 
    (т.к 2**10 > 1000,для 2000 => 2**11 > 200)
    
    ip :    115.53.128.88
    maska:  255.255.x.0
    ---------------------
    adress: 115.53.128.0
    
    1:
    ip 128: 10000000
    maska : 1-------
    adress: 10000000
    
    10000000
    11000000
    11100000
    11110000
    11111000
    11111100
    otvet = 6
    '''
    ```
    
- **Кол-во компов**
    
    ```python
    ''' 31)  Если маска подсети 255.255.255.240 и IP-адрес компьютера в сети
    192.168.156.235, то номер компьютера в сети равен_____
    ip :   235 1110 1011
    maska: 240 1111 0000
    
    1011_2 = 11
    
    '''
    ```