<<<<<<< Updated upstream
''' 2.23. Масса бегемота x кг, а масса слона y кг. Какое наибольшее
количество бегемотов необходимо взять, чтобы их общая масса не превышала
массу слона?'''


x = int(input('Введите массу бегемота: '))
y = int(input('Введите массу слона(масса должна быть слона > масса бегемота): '))
k = (y // x)
print('Наибольшее количество бегемотов,\nчья масса будет меньше ,чем масса слонаб равна = ', k)
=======
''' 2.23. Масса бегемота x кг, а масса слона y кг. Какое наибольшее
количество бегемотов необходимо взять, чтобы их общая масса не превышала
массу слона?'''


x = int(input('Введите массу бегемота: '))
y = int(input('Введите массу слона(масса должна быть слона > масса бегемота): '))
k = (y // x)
print('Наибольшее количество бегемотов,\nчья масса будет меньше ,чем масса слонаб равна = ', k)
>>>>>>> Stashed changes
