# ЕГЭ-15

- **Задание с делителями**
    
    ```python
    '''
    № 5.89 (; ). Обозначим через ДЕЛ(n; m) утверждение «натуральное число n делится
    без остатка на натуральное число m».
    Для какого наибольшего натурального числа A формула
    ¬ДЕЛ(x; 66) ∨ (ДЕЛ(x; 12) → (3A − x < 600))
    тождественно истинна при любом натуральном значении переменной x?
    '''
    
    def Del(n, m):
        return n % m == 0
    
    def neDel(n, m):
        return n % m != 0
    
    def f(x,A):
        return neDel(x, 66) or (Del(x, 12) <= (3*A - x < 600))
    
    maxA = 1000
    t = []
    for A in range(1,maxA):
        ok = True
        for x in range(1,maxA):
            if not f(x,A):
                ok = False
                break
        if ok:
            t += [A]
    
    print(max(t))#243
    ```
    
- **Задание с поразрядной конъюнкцией(нужно ставит скобки в условии)**
    
    ```python
    '''
    № 5.95 (; ). Пусть K & M — выражение, обозначающее поразрядную конъюнкцию
    K и M (логическое «И» между соответствующими битами двоичной записи).
    Например, для K = 1102 и M = 10112: K & M = 1102 & 10112 = 102.
    Определите наибольшее натуральное число A, такое что выражение
    ¬(x & 44 = 0 → x & A = 0) ∧ x & 76 = 0
    тождественно ложно при любом натуральном значении переменной x.
    '''
    def f(x, A):
        res = not ((x & 44 == 0) <= ( x & A == 0)) and (x & 76 == 0)
        return not res# т.к тождественно ложно при любом натуральном значении переменной x
    
    maxA = 1000
    t = []
    for A in range(1, maxA):
        ok = True
        for x in range(1, maxA):
            if not f(x, A):
                ok = False
                break
        if ok:
            t += [A]
    
    print(max(t))#108
    ```
    
- **Отрезок**
    
    ```python
    min_ = 100000
    p = [i for i in range(23, 59)]
    q = [i for i in range(1, 40)]
    for ami in range(1, 101):
        for amx in range(ami + 1, 101):
            flag = True
            a = [i for i in range(ami, amx)]
            for x in range(1, 101):
                f = ((x in p) or (x in a)) <= ((x in q) or (x in a))
                if not f:
                    flag = False
                    break
            if flag :
                min_ = min(min_,amx - ami)
    print(min_)#19
    
    ```
    
- **Плоскость**
    
    ```python
    '''
    (4x + 3y̸ = 40) ∨ (7x + 2y < A) ∧ (2x2 + 5y − 5 < A)
    '''
    def f(x, y, A):
        return (4*x + 3*y != 40) or (7*x + 2*y < A) \
               and (2*x**2 + 5*y - 5 < A)
    
    maxA = 200
    t = []
    
    for A in range(maxA):
        ok = True
        for x in range(maxA):
            for y in range(maxA):
                if not f(x, y, A):
                    ok = False
                    break
            if not ok:
                break
        if ok:
            t += [A]
    
    print(min(t))#196
    ```