# ЕГЭ-8

- **8-ое задание с повторяющимися буквами**
    
    ```python
    ''' 188)  Миша составляет 5-буквенные коды из букв С, А, К, У, Р, А.
    Каждая допустимая гласная буква может входить в код не более одного
    раза. Сколько кодов может составить Миша?
    '''
    
    from itertools import product
    
    abc = 'САКУР'
    cmb = product(abc,repeat=5)
    
    cmb = [w for w in cmb if w.count('А') <= 1  and w.count('У') <= 1]
    print(len(cmb))#1593
    '''
    Если есть повторяющиеся буквы ,то их убираем 
    и оставляем одну
    '''
    ```
    
- **8-ое задание,где нужно рассмотреть все случаи**
    
    ```python
    ''' 58)  (М.В. Кузнецова) Вася составляет 4-буквенные слова, в которых
    есть только буквы П, И, Р, О, Г, причём в каждом слове буква О может
    встречаться не более двух раз, при этом, если она есть, то перед ней
    обязательно стоит согласная буква.
    
    Каждая из других допустимых букв
    может встречаться в слове любое количество раз или не встречаться
    совсем. Словом считается любая допустимая последовательность букв, не
    обязательно осмысленная. Сколько существует таких слов, которые может
    написать Вася?'''
    from itertools import product
    
    abc = 'ПИРОГ'
    abc1 = 'ПРГ'
    cmb = product(abc,repeat=4)
    cmb = {''.join(w) for w in cmb}
    
    a1 = [w for w in cmb if 'О' not in w]
    a2 = [ w for w in cmb if 'О' and 1 <= w.count('О') <= 2 and w[0] != 'О'\
           and 'ИО' not in w and 'ОО' not in w]
    print(len(a1) + len(a2))#409
    
    '''
    Алгоритм :
    1)Для начала все также
    2)Потом просто рассматриваем все случаи по отдельности
    3)Считаем длину поллученнных массивов
    '''
    ```
    
    - 8-ое задание ,где нужно найт
- **8-ое задание ,где нужно найти на каком месте стоит слово или что за слова**
    
    ```python
    '''
    6)	Все 5-буквенные слова, составленные из букв А, К, Р, У,
    записаны в алфавитном порядке. Вот начало списка:
    1. ААААА
    2. ААААК
    3. ААААР
    4. ААААУ
    5. АААКА
    ……
    Запишите слово, которое стоит на 250-м месте от начала списка. 
    '''
    
    abc = sorted('АКРУ')
    cnt = 0
    for c1 in abc:
        for c2 in abc:
            for c3 in abc:
                for c4 in abc:
                    for c5 in abc:
                        cnt += 1
                        wrd = c1 + c2 + c3 + c4 + c5
                        if cnt == 250:
                            print(wrd)#АУУРК
    '''
    ------------------------------
    product - если буквы в слове могут повторяться
    permutations - наоборот(или перестановка)
    
    '''
    from itertools import product
    
    abc = 'АКРУ'
    cmb = [''.join(w) for w in product(abc,repeat = 5)]
    print(cmb[250])##АУУРК
    ```
    
- **Доп.инфа,но важная**
    
    ```python
    ''' 122)  (А.Н. Носкин) Петя составляет шестибуквенные слова
    перестановкой букв слова МОЛОКО. Сколько всего различных слов может
    составить Петя?
    '''
    from itertools import permutations
    
    abc = 'МОЛОКО'
    cmb = permutations(abc,6)
    cmb = {''.join(w) for w in cmb}
    **//{} - убирают повторы в отличии от []**
    
    print(cmb)
    print(len(cmb))#120
    ```
    
    ```python
    Другой вариант функции на проверку ,подряд идущих
    цифр
    
    def ok2(s):
        bC = [''.join(w) for w in permutations('02468',2)]
    		bN = [''.join(w) for w in permutations('13579',2)]
    		for bad in bC + bN:
    				if bad in s:
    					 return False
    		return True
    
    ```