# ЕГЭ-17

- **Типовая задача**
    
    ```python
    ''' 211)  В файле 17-4.txt содержится последовательность целых чисел.
    Элементы последовательности могут принимать целые значения от 0 до 10
    000 включительно.
    
    Определите количество пар, в которых хотя бы один из
    двух элементов больше, чем среднее арифметическое всех чисел в файле, а
    их сумма делится на 7.
    
    В ответе запишите два числа: сначала количество
    найденных пар, а затем – минимальную сумму элементов таких пар. В данной
    задаче под парой подразумевается два идущих подряд элемента
    последовательности.'''
    
    with open('17-4.txt') as txt:
        s = txt.read().split()
        a = [int(x) for x in s]
    
    sred_arith = sum(a) // len(a)
    cnt = 0
    res_a = []
    for i in range(0,len(a)-1):
        if (a[i] > sred_arith or a[i+1] > sred_arith) \
           and (a[i] + a[i+1]) % 7 == 0:
                cnt += 1
                res_a.append(a[i] + a[i+1])
    
    print(cnt,min(res_a))#202 6916
    
    '''
    Алгоритм :
    1)Сначала считываем наш текстовый файл,а затем конвертируем его в массив целых
    чисел
    *//with open('17-4.txt') as txt:
    //    s = txt.read().split()
    ///   a = [int(x) for x in s]*
    2)Выполняем допы(доп. условия) //в данном случае найти среднее арифметическое
    *//sred_arith = sum(a) // len(a)*
    3)Затем делаем цикл по текстовому файлу и перебираем пары(нужно уточнять ,что
    авторы имеют под парами),подходящие условию(двух элементов больше, 
    чем среднее арифметическое всех чисел в файле, а
    их сумма делится на 7.)
    *//for i in range(0,len(a)-1):
    //    if (a[i] > sred_arith or a[i+1] > sred_arith) \
    //       and (a[i] + a[i+1]) % 7 == 0:
    //            cnt += 1
    //            res_a.append(a[i] + a[i+1])*
    4)Считаем их кол-во и минимальную сумму ,подходящих пар(крч выполняем основную 
    задачу)
    *//print(cnt,min(res_a))
    //*
    '''
    ```