# ЕГЭ-12(тупая работа с файлом)

- **Типовое задание**
    
    ```python
    ''' 147)  Исполнитель Редактор получает на вход строку цифр и
    преобразовывает её. Редактор может выполнять две команды, в обеих
    командах v и w обозначают цепочки цифр. заменить (v, w) нашлось (v) Дана
    программа для исполнителя Редактор: НАЧАЛО ПОКА нашлось (4444) ИЛИ
    нашлось (7777)
      ЕСЛИ нашлось (4444)
        ТО заменить (4444, 77)
        ИНАЧЕ заменить (7777, 44)
      КОНЕЦ ЕСЛИ
    КОНЕЦ ПОКА КОНЕЦ Какая строка получится в результате применения
    приведённой выше программы к строке, состоящей из 86 идущих подряд цифр
    7? В ответе запишите полученную строку.
    
    '''
    s = 86 * '7'
    while '4444' in s or '7777' in s :
        if '4444' in s:
            s = s.replace('4444','77',1)
        else:
            s = s.replace('7777','44',1)
            
    print(s)#77
    
    '''
    Алгоритм - в тупую реализовать условиях задачи
    '''
    ```