# ЕГЭ-9

- Типовая задача
    
    ```python
    ''' 161)  (ЕГЭ-2022) В файле электронной таблицы 9-161.xls в каждой
    строке содержатся четыре натуральных числа. Определите количество строк
    таблицы, содержащих числа, для которых выполнены оба условия:
    – наибольшее из четырёх чисел меньше суммы трёх других;
        a[-1] < a[0] + a[1] + a[2] 
    – среди четырех чисел есть только одна пара равных чисел.
        len(a1) == 2 and len(a2) == 2
    '''
    cnt = 0
    with open('9-161.csv') as ff:
        for s in ff:
            a = [int(x) for x in s.split(';')]
            a.sort()
            a1 = [x for x in a if a.count(x) == 1]
            a2 = [x for x in  a if a.count(x) == 2]
            if a[-1] < a[0] + a[1] + a[2]:
                if len(a1) == 2 and len(a2) == 2:
                    cnt += 1
    
    print(cnt)#133
    '''
    Алгоритм :
    1)Открываем .xls файл и сохраняем его в формате .csv
    2)Затем считываем его
    3)Составляем условия (для программирования)
    4)Программируем
    
    a.sort()#Обязательно
    a1 = [x for x in a if a.count(x) == 1]
    #Разделяем наш основной список на те ,которые не повторяются
    a2 = [x for x in  a if a.count(x) == 2]
    #И те ,на которые не повторяются
    ...
    if len(a1) == 2 and len(a2) == 2:
    #2 длины массивов ,т.к всего 4-ре элемента было,а
    по условию два должны были повтоярться
    '''
    ```
    
- Задачи с треугольником(каждая сторона меньше сумме других сторон)
    
    #Правило треугольника - это когда одна сторона не может быть больше и равна сумме двух других сторон
    
    ```python
    ''' 96)  (демо-2022) Откройте файл электронной таблицы 9-96.xls,
    содержащей в каждой строке три натуральных числа. Выясните, какое
    количество троек чисел может являться сторонами треугольника, то есть
    удовлетворяет неравенству треугольника. В ответе запишите только число.
    '''
    cnt = 0
    with open('9-96.csv') as ff:
        for s in ff:
            a = [int(x) for x in s.split(';')]
            a.sort()
            if a[0] < a[1] + a[2] and a[1] < a[0] + a[2] \
               and a[2] < a[0] + a[1]:
                cnt += 1
    
    print(cnt)#2453
    ```
    
- Пифагоровы тройки(квадрат гипотенузы равен квадрату катетов)
    
    ```python
    ''' 98)  (А. Комков, Челябинск). Откройте файл электронной таблицы
    9-97.xls, содержащей в каждой строке три натуральных числа. Выясните,
    какие тройки чисел являются пифагоровыми тройками, то есть являться
    сторонами прямоугольного треугольника. В ответе запишите максимальную
    гипотенузу из всех найденных пифагоровых троек.
    '''
    t = []
    with open('9-97.csv') as ff:
        for s in ff:
            a = [int(x) for x in s.split(';')]
            a.sort()
            if a[2]**2 == a[0]**2 + a[1]**2:
                t +=[a[2]]
    
    print(max(t))#685
    ```
    
- Доп.инфа(Проверка на простоту)
    
    ```python
    from math import gcd
    
    if gcd(a[0],a[1],a[2]) == 1: 
    -проверка на пустоту
    ```