'''
5. Дано действительное b > 0. Найти первый член последовательности a1, a2,. . . ,
образованной по закону:
    a_1 = -1,  a_i = 2 + i*a_i-1
который больше b
'''
b = float(input('b(>0) >>> '))
a = -1
i = 1

print('%3d %7.2f %6s' %(i, a, b > a))
while b > a:
    i += 1
    a = 2 + i*a
    print('%3d %7.2f %6s' %(i, a, b > a))

print('Result: %6.2f' %a)