### Вычисление конечных сумм и произведений
**Алгоритм вычисления суммы:**
- `s = 0` 
- `n = s + a` - вычисление
**Алгоритм вычисления произведения:**
- `p = 1` 
- `n = p*a` 
```
sum_ = 0
i = 1
while i <= 10:
	sum_ += i
	i += 1
print(sum_)
```
**Python как пакет символьных вычисление - sympy**
```
from sympy import *

i = Symbol('i')

pprint(Sum(i, (i, 1, 10)))

s = Sum(i, (i, 1, 10)).doit()
print(s)
```
**1.Зацикливание(отсутсвует переменна регулирующая работу цикла)**
```
while True:
	print()
```
**2.Зацикливание(Пустой шаг)**
```
sum_ = 0
i = 1
while i <= 10:
	sum_ = sum_
i = i + 1
```
### Числовые последовательности
**Последовательность** - это набор элементов некоторого множества, пронумерованный натуральными числами
```
a = float(input('a > 1 >>> '))
b = float(input('b >>> '))

if a < b:
	d = a
	while d < b:
		print(d)
		d = d * a
else:
	print(a > b)
```